#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/gamersnote/gamersnote/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/gamersnote/gamersnote

To view this run in a browser, visit:
https://app.terraform.io/app/happyfukumoto/gamersnote/runs/run-sbRC9KaUuAUXaero

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:455000526485:cluster/gamersnote]
module.ecs.aws_iam_role.ecs_task_role: Refreshing state... [id=ecs_task_role]
module.ecr.aws_ecr_repository.api: Refreshing state... [id=gamersnote-api]
module.vpc.module.aws_vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b912a34575a4253a]
module.vpc.module.aws_vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0e81ff7ec6af5af90]
module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ap-northeast-1:455000526485:certificate/00a8ad21-ff76-4da4-845e-df28678f7b2b]
module.ecs.aws_iam_policy.ecs_task_ex_policy: Refreshing state... [id=arn:aws:iam::455000526485:policy/ecs_task_ex_policy]
module.ecs.aws_iam_policy.ecs_task_policy: Refreshing state... [id=arn:aws:iam::455000526485:policy/ecs_task_policy]
module.ecr.aws_ecr_repository.app: Refreshing state... [id=gamersnote-app]
module.ecs.aws_iam_role.ecs_task_ex_role: Refreshing state... [id=ecs_task_ex_role]
module.ecs.aws_iam_policy_attachment.ecs_task_policy_attach: Refreshing state... [id=ecs_task_policy_attach]
module.ecs.aws_ecs_task_definition.api: Refreshing state... [id=gamersnote-api]
module.ecs.aws_iam_policy_attachment.ecs_task_ex_policy_attach: Refreshing state... [id=ecs_task_ex_policy_attach]
module.acm.aws_route53_record.this["gamersnote.com"]: Refreshing state... [id=Z05181772U0208ZLB3AL8__8206226daa44e7e47b445ae8273d8106.gamersnote.com._CNAME]
module.acm.aws_acm_certificate_validation.this: Refreshing state... [id=2020-12-18 12:55:48 +0000 UTC]
module.vpc.module.aws_vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0038bf597d7fa3342]
module.vpc.module.aws_vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-086a526a8e2940105]
module.vpc.module.aws_vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-07153c3f6cb0fcc1f]
module.vpc.module.aws_vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-03d35f9d7f8e1d1b1]
module.vpc.module.aws_vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0999cbab79b0169de]
module.vpc.module.aws_vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-007848b304bba0120]
module.vpc.module.aws_vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01901d747fa38dd39]
module.alb.aws_security_group.alb: Refreshing state... [id=sg-00a0a573a96120ec3]
module.ecs.aws_security_group.this: Refreshing state... [id=sg-05f0ddf40cf30e7c3]
module.vpc.module.aws_vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-037f7097ace0bc71b]
module.vpc.module.aws_vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0455706d64301bbcf]
module.vpc.module.aws_vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0eb1a678d2b5eae2d]
module.rds.aws_db_subnet_group.main: Refreshing state... [id=gamersnote-subnet-group]
module.vpc.module.aws_vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06d189796c3405612]
module.vpc.module.aws_vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cd0e858ac8458eb4]
module.vpc.module.aws_vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01901d747fa38dd391080289494]
module.alb.module.aws_alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:loadbalancer/app/gamersnote-alb/d9ddc26d4c0823a6]
module.vpc.module.aws_vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-07153c3f6cb0fcc1f1080289494]
module.rds.aws_db_instance.main: Refreshing state... [id=terraform-20201219120652604700000001]
module.alb.aws_route53_record.this: Refreshing state... [id=Z05181772U0208ZLB3AL8_gamersnote.com_A]
module.alb.module.aws_alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:targetgroup/gn-20201218125837691800000002/94da241c0ea57274]
module.alb.module.aws_alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:listener/app/gamersnote-alb/d9ddc26d4c0823a6/3e2ab12ba64b7f72]
module.alb.module.aws_alb.aws_lb_listener.frontend_https[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:455000526485:listener/app/gamersnote-alb/d9ddc26d4c0823a6/b8a513befb65e349]
module.ecs.aws_ecs_service.api: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:455000526485:service/gamersnote/gamersnote-api]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.rds.aws_db_instance.main must be replaced
-/+ resource "aws_db_instance" "main" {
      ~ address                               = "terraform-20201219120652604700000001.cdqmclcxiot5.ap-northeast-1.rds.amazonaws.com" -> (known after apply)
      + apply_immediately                     = (known after apply)
      ~ arn                                   = "arn:aws:rds:ap-northeast-1:455000526485:db:terraform-20201219120652604700000001" -> (known after apply)
      ~ availability_zone                     = "ap-northeast-1c" -> (known after apply)
      ~ backup_retention_period               = 0 -> (known after apply)
      ~ backup_window                         = "17:32-18:02" -> (known after apply)
      ~ ca_cert_identifier                    = "rds-ca-2019" -> (known after apply)
      + character_set_name                    = (known after apply)
      - deletion_protection                   = false -> null
      - domain                                = "" -> null
      - domain_iam_role_name                  = "" -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "terraform-20201219120652604700000001.cdqmclcxiot5.ap-northeast-1.rds.amazonaws.com:5432" -> (known after apply)
      ~ hosted_zone_id                        = "Z24O6O9L7SGTNB" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ id                                    = "terraform-20201219120652604700000001" -> (known after apply)
      ~ identifier                            = "terraform-20201219120652604700000001" -> "gamersnote-db" # forces replacement
      + identifier_prefix                     = (known after apply)
      - iops                                  = 0 -> null
      ~ kms_key_id                            = "" -> (known after apply)
      ~ latest_restorable_time                = "0001-01-01T00:00:00Z" -> (known after apply)
      ~ license_model                         = "postgresql-license" -> (known after apply)
      ~ maintenance_window                    = "wed:14:48-wed:15:18" -> (known after apply)
      - max_allocated_storage                 = 0 -> null
      ~ monitoring_role_arn                   = "" -> (known after apply)
      ~ multi_az                              = false -> (known after apply)
        name                                  = "gamersnote"
      ~ option_group_name                     = "default:postgres-12" -> (known after apply)
      ~ performance_insights_kms_key_id       = "" -> (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 5432 -> (known after apply)
      ~ replicas                              = [] -> (known after apply)
      - replicate_source_db                   = "" -> null
      ~ resource_id                           = "db-P6JNPHOL24CWWZCCUBH4JOLEZM" -> (known after apply)
      - security_group_names                  = [] -> null
      ~ status                                = "available" -> (known after apply)
      - storage_encrypted                     = false -> null
      - tags                                  = {} -> null
      ~ timezone                              = "" -> (known after apply)
      ~ vpc_security_group_ids                = [
          - "sg-0ba136247a8f105a8",
        ] -> (known after apply)
        # (16 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>
*Pusher: @happyfukumoto, Action: `pull_request`*